# Taps
tap "nikitabobko/tap"
tap "steipete/tap"
tap "marcus/tap"

# CLI Tools
brew "fish"
brew "tmux"
brew "neovim"
brew "bat"
brew "eza"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "jq"
brew "starship"
brew "grc"
brew "chezmoi"
brew "marcus/tap/td"
brew "marcus/tap/sidecar"
brew "gh"
brew "rtk"
brew "googleworkspace-cli"

# Development
brew "python@3.12"
brew "uv"
brew "ruff"
brew "go"
brew "gopls"
brew "zig"
brew "node"
brew "rustup"
brew "hugo"

# Utilities
brew "docker"
brew "colima"
brew "xh"
brew "dust"
brew "yazi"
brew "qemu"
brew "claude-code"
brew "antigravity-cli"
brew "glow"
brew "pandoc"

# GUI Apps
{{- if eq .profile "home" }}
cask "discord"
cask "firefox"
{{- end }}
{{- if eq .profile "work" }}
cask "slack"
{{- end }}
cask "spotify"
cask "bitwarden"
cask "obsidian"
cask "alfred"
cask "zotero"
cask "ghostty"
cask "cmux"
cask "hyperkey"
cask "aerospace"

# Fonts
cask "font-fira-code-nerd-font"
