# Taps
tap "nikitabobko/tap"
tap "foundry-rs/foundry"

# CLI Tools
brew "fish"
brew "tmux"
brew "neovim"
brew "bat"
brew "eza"
brew "ripgrep"
brew "fzf"
brew "jq"
brew "starship"
brew "grc"
brew "chezmoi"

# Development
brew "python@3.12"
brew "uv"
brew "ruff"
brew "go"
brew "gopls"
brew "node"
brew "bun"
brew "hugo"

# Utilities
brew "atac"
brew "docker"
brew "colima"
brew "xh"
brew "gitui"
brew "dust"
brew "yazi"
brew "qemu"
brew "foundry"
brew "gemini-cli"

# GUI Apps
cask "discord"
cask "spotify"
cask "whatsapp"
cask "bitwarden"
cask "obsidian"
cask "alfred"
cask "zotero"
cask "ghostty"
cask "firefox"
cask "transmission"
cask "hammerspoon"
cask "karabiner-elements"
cask "aerospace"

# Fonts
cask "font-fira-code-nerd-font"
